# 1. Используем официальный образ Python как основу
FROM python:3.11-slim

# --- ИЗМЕНЕНИЕ ЗДЕСЬ: Устанавливаем правильную рабочую директорию ---
WORKDIR /src

# 3. Копируем файл с зависимостями в контейнер
COPY requirements.txt .

# 4. Устанавливаем зависимости
# Добавляем --no-cache-dir для уменьшения размера образа
RUN pip install --no-cache-dir -r requirements.txt

# 5. Копируем весь код нашего приложения в контейнер
COPY . .

# 6. Команда, которая будет запускать бота при старте контейнера
# Python будет искать main.py в рабочей директории /src
CMD ["python", "main.py"]