DISTRICTS = {
    "Калининград": [
        'Центральный (весь)',
        'мкр. Сельма',
        'Амалиенау / Центр',
        'Ленинградский (весь)',
        'Верхнее Озеро',
        'Московский (весь)',
        'Остров Канта'
    ],
    "Побережье": ['Зеленоградск', 'Светлогорск', 'Янтарный', 'Пионерский', 'Балтийск'],
    "Куршская коса": ["Куршская коса"],
    "Другие города": ['Черняховск', 'Советск', 'Гусев', 'Другой']
}

PROPERTY_TYPES = ['Квартира', 'Апартаменты', 'Дом', 'Кемпинг']
ROOM_OPTIONS = ['Студия', '1', '2', '3', '4', '5+']
GUEST_OPTIONS = ['1', '2', '3', '4', '5', '6', '7', '8+']